这是一个前后端分离的用户管理系统，用户登陆后根据自身角色，在系统内有不同程度的权限，可以进行不同的操作。
角色可在系统内进行的部分测试功能尚未完成。
本文引入了Swagger文档工具，可使用其对程序进行测试

前端
    运行端口:8090 目前使用的运行版本 dev
    运行命令: npm run dev
后端运行端口：9999
主要由以下两个部分组成:
后端部分:
    user-admin 文件，其主要完成如下几个方面的：
        对全体用户的管理:
            实现增、删、改、查等操作，同时实现对用户对应角色权限的操作
            实现新增角色时，对其密码使用SHA256进行加密处理
        系统内角色的管理:
            设置各角色属性的操作权限、
            查看、新增、删除、修改 各角色属性的操作权限
        菜单管理:
            实现不同角色属性用户登录后，根据权限不同，展示返回不同的菜单

前端部分：
    基于vue-admin-template-4.4.0进行开发，大部分由他人完成，本文中主要完成与其的对接工作

